#ifndef LIGHT_H
#define LIGHT_H

//--------------------------------------------------------------------------
#include <glm/glm.hpp>

//--------------------------------------------------------------------------
// Структура источника света
struct Light
{
    glm::vec4 position; // Позиция. Если w=0.0, то это направленный свет (солнце), если w=1.0 - точечный
    glm::vec4 ambient;
    glm::vec4 diffuse;
    glm::vec4 specular;

    Light()
    {
        position = glm::vec4(10.0f, 20.0f, 10.0f, 0.0f); // w=0.0 - направленный свет (солнце)

        ambient = glm::vec4(0.2f, 0.2f, 0.2f, 1.0f);
        diffuse = glm::vec4(0.8f, 0.8f, 0.8f, 1.0f);
        specular = glm::vec4(1.0f, 1.0f, 1.0f, 1.0f);
    }
    ~Light()
    {
    }
};

//--------------------------------------------------------------------------
#endif // LIGHT_H